TGV/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	rhoEnergyFoam;

startFrom       	startTime;

startTime       	680;

stopAt          	endTime;

endTime         	1360;

deltaT           	0.00065;

writeControl    	adjustableRunTime;

writeInterval   	68;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	yes;

adjustTimeStep  	yes;

maxCo         		1.0;

maxDeltaT       	1.;

pressArtDiff    	false; //activate artificial diffusion on pressure
convArtDiff     	false; //activate artificial diffusion on pressure

ducLevelPress       	1.05;
ducLevelConv        	1.05;
epsilon             	0.00014; 
minfty              	0.01; 
kp                  	0.25;//25;
ku                  	0.75;//75;
chi 		    	1.0;


// ************************************************************************* //
