TGV/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
32448
(
(-0.0061148 0.00377134 0)
(-0.00495266 0.0039369 0)
(-0.00554633 0.0044972 0)
(-0.00541886 0.00334212 0)
(-0.00437137 0.00354449 0)
(-0.00430329 0.00342071 0)
(-0.00389796 0.00240409 0)
(-0.00266575 0.0021615 0)
...
)
;

boundaryField
{
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch0_half0
    {
        type            cyclic;
    }
}


// ************************************************************************* //
