TGV/0/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Q;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
32448
(
-4.588e-05
-6.82482e-05
-7.36258e-05
-3.32242e-05
-2.20885e-05
-4.37356e-05
-1.20208e-05
-1.28251e-06
...
)
;

boundaryField
{
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch0_half0
    {
        type            cyclic;
    }
}


// ************************************************************************* //
